{"backend": "tensorflow", "config": {"output_layers": [["reshape_1", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 16, 16, 2], "sparse": false, "dtype": "float32", "name": "input_layer"}, "inbound_nodes": [], "name": "input_layer", "class_name": "InputLayer"}, {"config": {"batch_input_shape": [null, 16, 16, 2], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [5, 5], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "filters": 128, "dtype": "float32", "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "padding": "valid", "name": "conv2d_1", "use_bias": true}, "inbound_nodes": [[["input_layer", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten"}, {"config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 512, "use_bias": true}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"trainable": true, "name": "reshape_1", "target_shape": [16, 16, 2]}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "reshape_1", "class_name": "Reshape"}], "name": "model_1", "input_layers": [["input_layer", 0, 0]]}, "class_name": "Model", "keras_version": "2.0.2"}