{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 3, "name": "convolution2d_1", "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "nb_col": 1, "input_dtype": "float32", "W_constraint": null, "activation": "linear", "subsample": [1, 1], "batch_input_shape": [null, 16, 16, 2], "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "bias": true, "trainable": true, "activity_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 14336, "name": "dense_1", "init": "glorot_uniform", "b_regularizer": null, "activation": "relu", "bias": true, "W_constraint": null, "output_dim": 512, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "target_shape": [16, 16, 2], "trainable": true}}], "keras_version": "1.2.1"}