{"class_name": "Model", "config": {"input_layers": [["input_layer", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_layer", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 16, 16, 2], "name": "input_layer"}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_layer", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "conv2d_1", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [4, 4], "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "filters": 64, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "use_bias": true, "batch_input_shape": [null, 16, 16, 2], "bias_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "use_bias": true, "bias_constraint": null}}, {"class_name": "Reshape", "name": "reshape_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"trainable": true, "name": "reshape_1", "target_shape": [16, 16, 2]}}, {"class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["reshape_1", 0, 0, {}], ["input_layer", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_1", "axis": -1}}], "output_layers": [["concatenate_1", 0, 0]]}, "keras_version": "2.0.2", "backend": "tensorflow"}