{"config": {"input_layers": [["input_layer", 0, 0]], "name": "model_1", "layers": [{"config": {"dtype": "float32", "name": "input_layer", "batch_input_shape": [null, 16, 16, 2], "sparse": false}, "class_name": "InputLayer", "name": "input_layer", "inbound_nodes": []}, {"config": {"use_bias": true, "name": "conv2d_1", "trainable": true, "kernel_size": [5, 5], "padding": "valid", "strides": [1, 1], "dtype": "float32", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "batch_input_shape": [null, 16, 16, 2], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "filters": 128, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_layer", 0, 0, {}]]]}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"use_bias": true, "units": 512, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"name": "reshape_1", "target_shape": [16, 16, 2], "trainable": true}, "class_name": "Reshape", "name": "reshape_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["reshape_1", 0, 0, {}], ["input_layer", 0, 0, {}]]]}], "output_layers": [["concatenate_1", 0, 0]]}, "class_name": "Model", "keras_version": "2.0.2", "backend": "tensorflow"}