{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "input_layer", "class_name": "InputLayer", "config": {"name": "input_layer", "batch_input_shape": [null, 16, 16, 2], "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["input_layer", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_last", "name": "conv2d_1", "batch_input_shape": [null, 16, 16, 2], "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "filters": 128, "kernel_size": [5, 5], "padding": "valid", "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_1", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 512, "bias_regularizer": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "target_shape": [16, 16, 2], "trainable": true}}], "name": "model_1", "input_layers": [["input_layer", 0, 0]], "output_layers": [["reshape_1", 0, 0]]}, "keras_version": "2.0.2"}